##########################################################################################################################
#########################################ここは変えるな 変えたら死#########################################################
##########################################################################################################################
import tkinter as tk
import ctypes

import utils.setting_enviroments as env
from entities.top import Top_page

# 初期化処理
env.init()
ctypes.windll.shcore.SetProcessDpiAwareness(1)

# スタートメニュー
top = Top_page("Start Menu",600,500,0,0)
# value -> 0:課金, 1:Gama Start, 2:Setting, 3:Exit
value=top.get_select_value()
print(value)

##########################################################################################################################
#########################################ここは変えるな 変えたら死#########################################################
##########################################################################################################################


# Tkinterを使用してウィンドウを作成
root = tk.Tk()
root.title("Hello, Tkinter!")
label = tk.Label(root, text="Hello, World!")
label.pack()
root.mainloop()

# ゲーム画面
while True:
    pass
